apache/nuttx/arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
/****************************************************************************
 * arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_AT32_HARDWARE_AT32FXXXXX_OTGFS_H
#define __ARCH_ARM_SRC_AT32_HARDWARE_AT32FXXXXX_OTGFS_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* General definitions */

#define OTGFS_EPTYPE_CTRL               (0) /* Control */
#define OTGFS_EPTYPE_ISOC               (1) /* Isochronous */
#define OTGFS_EPTYPE_BULK               (2) /* Bulk */
#define OTGFS_EPTYPE_INTR               (3) /* Interrupt */

#define OTGFS_PID_DATA0                 (0)
#define OTGFS_PID_DATA2                 (1)
#define OTGFS_PID_DATA1                 (2)
#define OTGFS_PID_MDATA                 (3) /* Non-control */
#define OTGFS_PID_SETUP                 (3) /* Control */

/* Register Offsets *********************************************************/

/* Core global control and status registers */

#define AT32_OTGFS_GOTGCTL_OFFSET      0x0000 /* Control and status register */
#define AT32_OTGFS_GOTGINT_OFFSET      0x0004 /* Interrupt register */
#define AT32_OTGFS_GAHBCFG_OFFSET      0x0008 /* AHB configuration register */
#define AT32_OTGFS_GUSBCFG_OFFSET      0x000c /* USB configuration register */
#define AT32_OTGFS_GRSTCTL_OFFSET      0x0010 /* Reset register */
#define AT32_OTGFS_GINTSTS_OFFSET      0x0014 /* Core interrupt register */
#define AT32_OTGFS_GINTMSK_OFFSET      0x0018 /* Interrupt mask register */
#define AT32_OTGFS_GRXSTSR_OFFSET      0x001c /* Receive status debug read/OTG status read register */
#define AT32_OTGFS_GRXSTSP_OFFSET      0x0020 /* Receive status debug read/OTG status pop register */
#define AT32_OTGFS_GRXFSIZ_OFFSET      0x0024 /* Receive FIFO size register */
#define AT32_OTGFS_HNPTXFSIZ_OFFSET    0x0028 /* Host non-periodic transmit FIFO size register */
#define AT32_OTGFS_DIEPTXF0_OFFSET     0x0028 /* Endpoint 0 Transmit FIFO size */
#define AT32_OTGFS_HNPTXSTS_OFFSET     0x002c /* Non-periodic transmit FIFO/queue status register */
#define AT32_OTGFS_GCCFG_OFFSET        0x0038 /* General core configuration register */
#define AT32_OTGFS_CID_OFFSET          0x003c /* Core ID register  */
#define AT32_OTGFS_HPTXFSIZ_OFFSET     0x0100 /* Host periodic transmit FIFO size register */

#define AT32_OTGFS_DIEPTXF_OFFSET(n)   (0x0104+(((n)-1) << 2)) /* n: 1 ~ 7 */

#define AT32_OTGFS_DIEPTXF1_OFFSET     0x0104 /* Device IN endpoint transmit FIFO1 size register */
#define AT32_OTGFS_DIEPTXF2_OFFSET     0x0108 /* Device IN endpoint transmit FIFO2 size register */
#define AT32_OTGFS_DIEPTXF3_OFFSET     0x010c /* Device IN endpoint transmit FIFO3 size register */
#define AT32_OTGFS_DIEPTXF4_OFFSET     0x0110 /* Device IN endpoint transmit FIFO4 size register */
#define AT32_OTGFS_DIEPTXF5_OFFSET     0x0114 /* Device IN endpoint transmit FIFO5 size register */
#define AT32_OTGFS_DIEPTXF6_OFFSET     0x0118 /* Device IN endpoint transmit FIFO6 size register */
#define AT32_OTGFS_DIEPTXF7_OFFSET     0x011c /* Device IN endpoint transmit FIFO7 size register */

/* Host-mode control and status registers */

#define AT32_OTGFS_HCFG_OFFSET         0x0400 /* Host configuration register */
#define AT32_OTGFS_HFIR_OFFSET         0x0404 /* Host frame interval register */
#define AT32_OTGFS_HFNUM_OFFSET        0x0408 /* Host frame number/frame time remaining register */
#define AT32_OTGFS_HPTXSTS_OFFSET      0x0410 /* Host periodic transmit FIFO/queue status register */
#define AT32_OTGFS_HAINT_OFFSET        0x0414 /* Host all channels interrupt register */
#define AT32_OTGFS_HAINTMSK_OFFSET     0x0418 /* Host all channels interrupt mask register */
#define AT32_OTGFS_HPRT_OFFSET         0x0440 /* Host port control and status register */

#define AT32_OTGFS_CHAN_OFFSET(n)      (0x500 + ((n) << 5) /* n: 0 ~ 15 */

#define AT32_OTGFS_HCCHAR_CHOFFSET     0x0000 /* Host channel characteristics register */
#define AT32_OTGFS_HCINT_CHOFFSET      0x0008 /* Host channel interrupt register */
#define AT32_OTGFS_HCINTMSK_CHOFFSET   0x000c /* Host channel interrupt mask register */
#define AT32_OTGFS_HCTSIZ_CHOFFSET     0x0010 /* Host channel interrupt register */

#define AT32_OTGFS_HCCHAR_OFFSET(n)    (0x500 + ((n) << 5)) /* n: 0 ~ 15 */

#define AT32_OTGFS_HCCHAR0_OFFSET      0x0500 /* Host channel-0 characteristics register */
#define AT32_OTGFS_HCCHAR1_OFFSET      0x0520 /* Host channel-1 characteristics register */
#define AT32_OTGFS_HCCHAR2_OFFSET      0x0540 /* Host channel-2 characteristics register */
#define AT32_OTGFS_HCCHAR3_OFFSET      0x0560 /* Host channel-3 characteristics register */
#define AT32_OTGFS_HCCHAR4_OFFSET      0x0580 /* Host channel-4 characteristics register */
#define AT32_OTGFS_HCCHAR5_OFFSET      0x05a0 /* Host channel-5 characteristics register */
#define AT32_OTGFS_HCCHAR6_OFFSET      0x05c0 /* Host channel-6 characteristics register */
#define AT32_OTGFS_HCCHAR7_OFFSET      0x05e0 /* Host channel-7 characteristics register */
#define AT32_OTGFS_HCCHAR8_OFFSET      0x0600 /* Host channel-8 characteristics register */
#define AT32_OTGFS_HCCHAR9_OFFSET      0x0620 /* Host channel-9 characteristics register */
#define AT32_OTGFS_HCCHAR10_OFFSET     0x060  /* Host channel-10 characteristics register */
#define AT32_OTGFS_HCCHAR11_OFFSET     0x0660 /* Host channel-11 characteristics register */
#define AT32_OTGFS_HCCHAR12_OFFSET     0x0680 /* Host channel-12 characteristics register */
#define AT32_OTGFS_HCCHAR13_OFFSET     0x06a0 /* Host channel-13 characteristics register */
#define AT32_OTGFS_HCCHAR14_OFFSET     0x06c0 /* Host channel-14 characteristics register */
#define AT32_OTGFS_HCCHAR15_OFFSET     0x06e0 /* Host channel-15 characteristics register */

#define AT32_OTGFS_HCINT_OFFSET(n)     (0x508 + ((n) << 5)) /* n: 0 ~ 15 */

#define AT32_OTGFS_HCINT0_OFFSET       0x0508 /* Host channel-0 interrupt register */
#define AT32_OTGFS_HCINT1_OFFSET       0x0528 /* Host channel-1 interrupt register */
#define AT32_OTGFS_HCINT2_OFFSET       0x0548 /* Host channel-2 interrupt register */
#define AT32_OTGFS_HCINT3_OFFSET       0x0568 /* Host channel-3 interrupt register */
#define AT32_OTGFS_HCINT4_OFFSET       0x0588 /* Host channel-4 interrupt register */
#define AT32_OTGFS_HCINT5_OFFSET       0x05a8 /* Host channel-5 interrupt register */
#define AT32_OTGFS_HCINT6_OFFSET       0x05c8 /* Host channel-6 interrupt register */
#define AT32_OTGFS_HCINT7_OFFSET       0x05e8 /* Host channel-7 interrupt register */
#define AT32_OTGFS_HCINT8_OFFSET       0x0608 /* Host channel-8 interrupt register */
#define AT32_OTGFS_HCINT9_OFFSET       0x0628 /* Host channel-9 interrupt register */
#define AT32_OTGFS_HCINT10_OFFSET      0x0648 /* Host channel-10 interrupt register */
#define AT32_OTGFS_HCINT11_OFFSET      0x0668 /* Host channel-11 interrupt register */
#define AT32_OTGFS_HCINT12_OFFSET      0x0688 /* Host channel-12 interrupt register */
#define AT32_OTGFS_HCINT13_OFFSET      0x06a8 /* Host channel-13 interrupt register */
#define AT32_OTGFS_HCINT14_OFFSET      0x06c8 /* Host channel-14 interrupt register */
#define AT32_OTGFS_HCINT15_OFFSET      0x06e8 /* Host channel-15 interrupt register */

#define AT32_OTGFS_HCINTMSK_OFFSET(n)  (0x50c + ((n) << 5)) /* n: 0 ~ 15 */

