apache/nuttx/arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
#define AT32_OTGFS_HCINTMSK0_OFFSET    0x050c /* Host channel-0 interrupt mask register */
#define AT32_OTGFS_HCINTMSK1_OFFSET    0x052c /* Host channel-1 interrupt mask register */
#define AT32_OTGFS_HCINTMSK2_OFFSET    0x054c /* Host channel-2 interrupt mask register */
#define AT32_OTGFS_HCINTMSK3_OFFSET    0x056c /* Host channel-3 interrupt mask register */
#define AT32_OTGFS_HCINTMSK4_OFFSET    0x058c /* Host channel-4 interrupt mask register */
#define AT32_OTGFS_HCINTMSK5_OFFSET    0x05ac /* Host channel-5 interrupt mask register */
#define AT32_OTGFS_HCINTMSK6_OFFSET    0x05cc /* Host channel-6 interrupt mask register */
#define AT32_OTGFS_HCINTMSK7_OFFSET    0x05ec /* Host channel-7 interrupt mask register */
#define AT32_OTGFS_HCINTMSK8_OFFSET    0x060c /* Host channel-8 interrupt mask register */
#define AT32_OTGFS_HCINTMSK9_OFFSET    0x062c /* Host channel-9 interrupt mask register */
#define AT32_OTGFS_HCINTMSK10_OFFSET   0x064c /* Host channel-10 interrupt mask register */
#define AT32_OTGFS_HCINTMSK11_OFFSET   0x066c /* Host channel-11 interrupt mask register */
#define AT32_OTGFS_HCINTMSK12_OFFSET   0x068c /* Host channel-12 interrupt mask register */
#define AT32_OTGFS_HCINTMSK13_OFFSET   0x06ac /* Host channel-13 interrupt mask register */
#define AT32_OTGFS_HCINTMSK14_OFFSET   0x06cc /* Host channel-14 interrupt mask register */
#define AT32_OTGFS_HCINTMSK15_OFFSET   0x06ec /* Host channel-15 interrupt mask register */

#define AT32_OTGFS_HCTSIZ_OFFSET(n)    (0x510 + ((n) << 5)) /* n: 0 ~ 15 */

#define AT32_OTGFS_HCTSIZ0_OFFSET      0x0510 /* Host channel-0 interrupt register */
#define AT32_OTGFS_HCTSIZ1_OFFSET      0x0530 /* Host channel-1 interrupt register */
#define AT32_OTGFS_HCTSIZ2_OFFSET      0x0550 /* Host channel-2 interrupt register */
#define AT32_OTGFS_HCTSIZ3_OFFSET      0x0570 /* Host channel-3 interrupt register */
#define AT32_OTGFS_HCTSIZ4_OFFSET      0x0590 /* Host channel-4 interrupt register */
#define AT32_OTGFS_HCTSIZ5_OFFSET      0x05b0 /* Host channel-5 interrupt register */
#define AT32_OTGFS_HCTSIZ6_OFFSET      0x05d0 /* Host channel-6 interrupt register */
#define AT32_OTGFS_HCTSIZ7_OFFSET      0x05f0 /* Host channel-7 interrupt register */
#define AT32_OTGFS_HCTSIZ8_OFFSET      0x0610 /* Host channel-8 interrupt register */
#define AT32_OTGFS_HCTSIZ9_OFFSET      0x0630 /* Host channel-9 interrupt register */
#define AT32_OTGFS_HCTSIZ10_OFFSET     0x0650 /* Host channel-10 interrupt register */
#define AT32_OTGFS_HCTSIZ11_OFFSET     0x0670 /* Host channel-11 interrupt register */
#define AT32_OTGFS_HCTSIZ12_OFFSET     0x0690 /* Host channel-12 interrupt register */
#define AT32_OTGFS_HCTSIZ13_OFFSET     0x06b0 /* Host channel-13 interrupt register */
#define AT32_OTGFS_HCTSIZ14_OFFSET     0x06d0 /* Host channel-14 interrupt register */
#define AT32_OTGFS_HCTSIZ15_OFFSET     0x06f0 /* Host channel-15 interrupt register */

/* Device-mode control and status registers */

#define AT32_OTGFS_DCFG_OFFSET         0x0800 /* Device configuration register */
#define AT32_OTGFS_DCTL_OFFSET         0x0804 /* Device control register */
#define AT32_OTGFS_DSTS_OFFSET         0x0808 /* Device status register */
#define AT32_OTGFS_DIEPMSK_OFFSET      0x0810 /* Device IN endpoint common interrupt mask register */
#define AT32_OTGFS_DOEPMSK_OFFSET      0x0814 /* Device OUT endpoint common interrupt mask register */
#define AT32_OTGFS_DAINT_OFFSET        0x0818 /* Device all endpoints interrupt register */
#define AT32_OTGFS_DAINTMSK_OFFSET     0x081c /* All endpoints interrupt mask register */
#define AT32_OTGFS_DIEPEMPMSK_OFFSET   0x0834 /* Device IN endpoint FIFO empty interrupt mask register */

#define AT32_OTGFS_DIEP_OFFSET(n)      (0x0900 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DIEPCTL_EPOFFSET    0x0000 /* Device endpoint control register */
#define AT32_OTGFS_DIEPINT_EPOFFSET    0x0008 /* Device endpoint interrupt register */
#define AT32_OTGFS_DIEPTSIZ_EPOFFSET   0x0010 /* Device IN endpoint transfer size register */
#define AT32_OTGFS_DTXFSTS_EPOFFSET    0x0018 /* Device IN endpoint transmit FIFO status register */

#define AT32_OTGFS_DIEPCTL_OFFSET(n)   (0x0900 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DIEPCTL0_OFFSET     0x0900 /* Device control IN endpoint 0 control register */
#define AT32_OTGFS_DIEPCTL1_OFFSET     0x0920 /* Device control IN endpoint 1 control register */
#define AT32_OTGFS_DIEPCTL2_OFFSET     0x0940 /* Device control IN endpoint 2 control register */
#define AT32_OTGFS_DIEPCTL3_OFFSET     0x0960 /* Device control IN endpoint 3 control register */
#define AT32_OTGFS_DIEPCTL4_OFFSET     0x0980 /* Device control IN endpoint 4 control register */
#define AT32_OTGFS_DIEPCTL5_OFFSET     0x09a0 /* Device control IN endpoint 5 control register */
#define AT32_OTGFS_DIEPCTL6_OFFSET     0x09c0 /* Device control IN endpoint 6 control register */
#define AT32_OTGFS_DIEPCTL7_OFFSET     0x09e0 /* Device control IN endpoint 7 control register */

#define AT32_OTGFS_DIEPINT_OFFSET(n)   (0x0908 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DIEPINT0_OFFSET     0x0908 /* Device endpoint-0 interrupt register */
#define AT32_OTGFS_DIEPINT1_OFFSET     0x0928 /* Device endpoint-1 interrupt register */
#define AT32_OTGFS_DIEPINT2_OFFSET     0x0948 /* Device endpoint-2 interrupt register */
#define AT32_OTGFS_DIEPINT3_OFFSET     0x0968 /* Device endpoint-3 interrupt register */
#define AT32_OTGFS_DIEPINT4_OFFSET     0x0988 /* Device endpoint-4 interrupt register */
#define AT32_OTGFS_DIEPINT5_OFFSET     0x09a8 /* Device endpoint-5 interrupt register */
#define AT32_OTGFS_DIEPINT6_OFFSET     0x09c8 /* Device endpoint-6 interrupt register */
#define AT32_OTGFS_DIEPINT7_OFFSET     0x09e8 /* Device endpoint-7 interrupt register */

#define AT32_OTGFS_DIEPTSIZ_OFFSET(n)  (0x910 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DIEPTSIZ0_OFFSET    0x0910 /* Device IN endpoint 0 transfer size register */
#define AT32_OTGFS_DIEPTSIZ1_OFFSET    0x0930 /* Device IN endpoint 1 transfer size register */
#define AT32_OTGFS_DIEPTSIZ2_OFFSET    0x0950 /* Device IN endpoint 2 transfer size register */
#define AT32_OTGFS_DIEPTSIZ3_OFFSET    0x0970 /* Device IN endpoint 3 transfer size register */
#define AT32_OTGFS_DIEPTSIZ4_OFFSET    0x0990 /* Device IN endpoint 4 transfer size register */
#define AT32_OTGFS_DIEPTSIZ5_OFFSET    0x09b0 /* Device IN endpoint 5 transfer size register */
#define AT32_OTGFS_DIEPTSIZ6_OFFSET    0x09d0 /* Device IN endpoint 6 transfer size register */
#define AT32_OTGFS_DIEPTSIZ7_OFFSET    0x09f0 /* Device IN endpoint 7 transfer size register */

#define AT32_OTGFS_DTXFSTS_OFFSET(n)   (0x0918 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DTXFSTS0_OFFSET     0x0918 /* Device OUT endpoint-0 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS1_OFFSET     0x0938 /* Device OUT endpoint-1 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS2_OFFSET     0x0958 /* Device OUT endpoint-2 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS3_OFFSET     0x0978 /* Device OUT endpoint-3 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS4_OFFSET     0x0998 /* Device OUT endpoint-4 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS5_OFFSET     0x09b8 /* Device OUT endpoint-5 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS6_OFFSET     0x09d8 /* Device OUT endpoint-6 TxFIFO status register */
#define AT32_OTGFS_DTXFSTS7_OFFSET     0x09f8 /* Device OUT endpoint-7 TxFIFO status register */

#define AT32_OTGFS_DOEP_OFFSET(n)      (0x0b00 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DOEPCTL_EPOFFSET    0x0000 /* Device control OUT endpoint 0 control register */
#define AT32_OTGFS_DOEPINT_EPOFFSET    0x0008 /* Device endpoint-x interrupt register */

