apache/nuttx/arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
#define AT32_OTGFS_DOEPCTL_OFFSET(n)   (0x0b00 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DOEPCTL0_OFFSET     0x00b00 /* Device OUT endpoint 0 control register */
#define AT32_OTGFS_DOEPCTL1_OFFSET     0x00b20 /* Device OUT endpoint 1 control register */
#define AT32_OTGFS_DOEPCTL2_OFFSET     0x00b40 /* Device OUT endpoint 2 control register */
#define AT32_OTGFS_DOEPCTL3_OFFSET     0x00b60 /* Device OUT endpoint 3 control register */
#define AT32_OTGFS_DOEPCTL4_OFFSET     0x00b80 /* Device OUT endpoint 4 control register */
#define AT32_OTGFS_DOEPCTL5_OFFSET     0x00ba0 /* Device OUT endpoint 5 control register */
#define AT32_OTGFS_DOEPCTL6_OFFSET     0x00bc0 /* Device OUT endpoint 6 control register */
#define AT32_OTGFS_DOEPCTL7_OFFSET     0x00be0 /* Device OUT endpoint 7 control register */

#define AT32_OTGFS_DOEPINT_OFFSET(n)   (0x0b08 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DOEPINT0_OFFSET     0x00b08 /* Device endpoint-0 interrupt register */
#define AT32_OTGFS_DOEPINT1_OFFSET     0x00b28 /* Device endpoint-1 interrupt register */
#define AT32_OTGFS_DOEPINT2_OFFSET     0x00b48 /* Device endpoint-2 interrupt register */
#define AT32_OTGFS_DOEPINT3_OFFSET     0x00b68 /* Device endpoint-3 interrupt register */
#define AT32_OTGFS_DOEPINT4_OFFSET     0x00b88 /* Device endpoint-4 interrupt register */
#define AT32_OTGFS_DOEPINT5_OFFSET     0x00ba8 /* Device endpoint-5 interrupt register */
#define AT32_OTGFS_DOEPINT6_OFFSET     0x00bc8 /* Device endpoint-6 interrupt register */
#define AT32_OTGFS_DOEPINT7_OFFSET     0x00be8 /* Device endpoint-7 interrupt register */

#define AT32_OTGFS_DOEPTSIZ_OFFSET(n)  (0x0b10 + ((n) << 5)) /* n: 0 ~ 7 */

#define AT32_OTGFS_DOEPTSIZ0_OFFSET    0x00b10 /* Device OUT endpoint-0 transfer size register */
#define AT32_OTGFS_DOEPTSIZ1_OFFSET    0x00b30 /* Device OUT endpoint-1 transfer size register */
#define AT32_OTGFS_DOEPTSIZ2_OFFSET    0x00b50 /* Device OUT endpoint-2 transfer size register */
#define AT32_OTGFS_DOEPTSIZ3_OFFSET    0x00b70 /* Device OUT endpoint-3 transfer size register */
#define AT32_OTGFS_DOEPTSIZ4_OFFSET    0x00b90 /* Device OUT endpoint-4 transfer size register */
#define AT32_OTGFS_DOEPTSIZ5_OFFSET    0x00bb0 /* Device OUT endpoint-5 transfer size register */
#define AT32_OTGFS_DOEPTSIZ6_OFFSET    0x00bd0 /* Device OUT endpoint-6 transfer size register */
#define AT32_OTGFS_DOEPTSIZ7_OFFSET    0x00bf0 /* Device OUT endpoint-7 transfer size register */

/* Power and clock gating registers */

#define AT32_OTGFS_PCGCCTL_OFFSET      0x0e00 /* Power and clock gating control register */

/* Data FIFO (DFIFO) access registers */

#define AT32_OTGFS_DFIFO_DEP_OFFSET(n) (0x1000 + ((n) << 12)) /* dev: n: 0 ~ 7  host: n: 0 ~ 15 */
#define AT32_OTGFS_DFIFO_HCH_OFFSET(n) (0x1000 + ((n) << 12)) /* dev: n: 0 ~ 7  host: n: 0 ~ 15 */

#define AT32_OTGFS_DFIFO_DEP0_OFFSET   0x1000 /* 0x1000-0x1ffc Device IN/OUT Endpoint 0 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH0_OFFSET   0x1000 /* 0x1000-0x1ffc Host OUT/IN Channel 0 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP1_OFFSET   0x2000 /* 0x2000-0x2ffc Device IN/OUT Endpoint 1 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH1_OFFSET   0x2000 /* 0x2000-0x2ffc Host OUT/IN Channel 1 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP2_OFFSET   0x3000 /* 0x3000-0x3ffc Device IN/OUT Endpoint 2 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH2_OFFSET   0x3000 /* 0x3000-0x3ffc Host OUT/IN Channel 2 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP3_OFFSET   0x4000 /* 0x4000-0x4ffc Device IN/OUT Endpoint 3 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH3_OFFSET   0x4000 /* 0x4000-0x4ffc Host OUT/IN Channel 3 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP4_OFFSET   0x5000 /* 0x1000-0x1ffc Device IN/OUT Endpoint 4 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH4_OFFSET   0x5000 /* 0x1000-0x1ffc Host OUT/IN Channel 4 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP5_OFFSET   0x6000 /* 0x2000-0x2ffc Device IN/OUT Endpoint 5 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH5_OFFSET   0x6000 /* 0x2000-0x2ffc Host OUT/IN Channel 5 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP6_OFFSET   0x7000 /* 0x3000-0x3ffc Device IN/OUT Endpoint 6 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH6_OFFSET   0x7000 /* 0x3000-0x3ffc Host OUT/IN Channel 6 DFIFO Read/Write Access */

#define AT32_OTGFS_DFIFO_DEP7_OFFSET   0x8000 /* 0x4000-0x4ffc Device IN/OUT Endpoint 7 DFIFO Write/Read Access */
#define AT32_OTGFS_DFIFO_HCH7_OFFSET   0x8000 /* 0x4000-0x4ffc Host OUT/IN Channel 7 DFIFO Read/Write Access */

/* Register Addresses *******************************************************/

#define AT32_OTGFS_GOTGCTL             (AT32_OTGFS1_BASE+AT32_OTGFS_GOTGCTL_OFFSET)
#define AT32_OTGFS_GOTGINT             (AT32_OTGFS1_BASE+AT32_OTGFS_GOTGINT_OFFSET)
#define AT32_OTGFS_GAHBCFG             (AT32_OTGFS1_BASE+AT32_OTGFS_GAHBCFG_OFFSET)
#define AT32_OTGFS_GUSBCFG             (AT32_OTGFS1_BASE+AT32_OTGFS_GUSBCFG_OFFSET)
#define AT32_OTGFS_GRSTCTL             (AT32_OTGFS1_BASE+AT32_OTGFS_GRSTCTL_OFFSET)
#define AT32_OTGFS_GINTSTS             (AT32_OTGFS1_BASE+AT32_OTGFS_GINTSTS_OFFSET)
#define AT32_OTGFS_GINTMSK             (AT32_OTGFS1_BASE+AT32_OTGFS_GINTMSK_OFFSET)
#define AT32_OTGFS_GRXSTSR             (AT32_OTGFS1_BASE+AT32_OTGFS_GRXSTSR_OFFSET)
#define AT32_OTGFS_GRXSTSP             (AT32_OTGFS1_BASE+AT32_OTGFS_GRXSTSP_OFFSET)
#define AT32_OTGFS_GRXFSIZ             (AT32_OTGFS1_BASE+AT32_OTGFS_GRXFSIZ_OFFSET)
#define AT32_OTGFS_HNPTXFSIZ           (AT32_OTGFS1_BASE+AT32_OTGFS_HNPTXFSIZ_OFFSET)
#define AT32_OTGFS_DIEPTXF0            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF0_OFFSET)
#define AT32_OTGFS_HNPTXSTS            (AT32_OTGFS1_BASE+AT32_OTGFS_HNPTXSTS_OFFSET)
#define AT32_OTGFS_GCCFG               (AT32_OTGFS1_BASE+AT32_OTGFS_GCCFG_OFFSET)
#define AT32_OTGFS_CID                 (AT32_OTGFS1_BASE+AT32_OTGFS_CID_OFFSET)
#define AT32_OTGFS_HPTXFSIZ            (AT32_OTGFS1_BASE+AT32_OTGFS_HPTXFSIZ_OFFSET)

#define AT32_OTGFS_DIEPTXF(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF_OFFSET(n))
#define AT32_OTGFS_DIEPTXF1            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF1_OFFSET)
#define AT32_OTGFS_DIEPTXF2            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF2_OFFSET)
#define AT32_OTGFS_DIEPTXF3            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF3_OFFSET)
#define AT32_OTGFS_DIEPTXF4            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF4_OFFSET)
#define AT32_OTGFS_DIEPTXF5            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF5_OFFSET)
#define AT32_OTGFS_DIEPTXF6            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF6_OFFSET)
#define AT32_OTGFS_DIEPTXF7            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTXF7_OFFSET)

/* Host-mode control and status registers */

