apache/nuttx/arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
#define AT32_OTGFS_HCFG                (AT32_OTGFS1_BASE+AT32_OTGFS_HCFG_OFFSET)
#define AT32_OTGFS_HFIR                (AT32_OTGFS1_BASE+AT32_OTGFS_HFIR_OFFSET)
#define AT32_OTGFS_HFNUM               (AT32_OTGFS1_BASE+AT32_OTGFS_HFNUM_OFFSET)
#define AT32_OTGFS_HPTXSTS             (AT32_OTGFS1_BASE+AT32_OTGFS_HPTXSTS_OFFSET)
#define AT32_OTGFS_HAINT               (AT32_OTGFS1_BASE+AT32_OTGFS_HAINT_OFFSET)
#define AT32_OTGFS_HAINTMSK            (AT32_OTGFS1_BASE+AT32_OTGFS_HAINTMSK_OFFSET)
#define AT32_OTGFS_HPRT                (AT32_OTGFS1_BASE+AT32_OTGFS_HPRT_OFFSET)

#define AT32_OTGFS_CHAN(n)             (AT32_OTGFS1_BASE+AT32_OTGFS_CHAN_OFFSET(n))

#define AT32_OTGFS_HCCHAR(n)           (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR_OFFSET(n))
#define AT32_OTGFS_HCCHAR0             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR0_OFFSET)
#define AT32_OTGFS_HCCHAR1             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR1_OFFSET)
#define AT32_OTGFS_HCCHAR2             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR2_OFFSET)
#define AT32_OTGFS_HCCHAR3             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR3_OFFSET)
#define AT32_OTGFS_HCCHAR4             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR4_OFFSET)
#define AT32_OTGFS_HCCHAR5             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR5_OFFSET)
#define AT32_OTGFS_HCCHAR6             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR6_OFFSET)
#define AT32_OTGFS_HCCHAR7             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR7_OFFSET)
#define AT32_OTGFS_HCCHAR8             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR8_OFFSET)
#define AT32_OTGFS_HCCHAR9             (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR9_OFFSET)
#define AT32_OTGFS_HCCHAR10            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR10_OFFSET)
#define AT32_OTGFS_HCCHAR11            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR11_OFFSET)
#define AT32_OTGFS_HCCHAR12            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR12_OFFSET)
#define AT32_OTGFS_HCCHAR13            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR13_OFFSET)
#define AT32_OTGFS_HCCHAR14            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR14_OFFSET)
#define AT32_OTGFS_HCCHAR15            (AT32_OTGFS1_BASE+AT32_OTGFS_HCCHAR15_OFFSET)

#define AT32_OTGFS_HCINT(n)            (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT_OFFSET(n))
#define AT32_OTGFS_HCINT0              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT0_OFFSET)
#define AT32_OTGFS_HCINT1              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT1_OFFSET)
#define AT32_OTGFS_HCINT2              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT2_OFFSET)
#define AT32_OTGFS_HCINT3              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT3_OFFSET)
#define AT32_OTGFS_HCINT4              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT4_OFFSET)
#define AT32_OTGFS_HCINT5              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT5_OFFSET)
#define AT32_OTGFS_HCINT6              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT6_OFFSET)
#define AT32_OTGFS_HCINT7              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT7_OFFSET)
#define AT32_OTGFS_HCINT8              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT8_OFFSET)
#define AT32_OTGFS_HCINT9              (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT9_OFFSET)
#define AT32_OTGFS_HCINT10             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT10_OFFSET)
#define AT32_OTGFS_HCINT11             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT11_OFFSET)
#define AT32_OTGFS_HCINT12             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT12_OFFSET)
#define AT32_OTGFS_HCINT13             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT13_OFFSET)
#define AT32_OTGFS_HCINT14             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT14_OFFSET)
#define AT32_OTGFS_HCINT15             (AT32_OTGFS1_BASE+AT32_OTGFS_HCINT15_OFFSET)

#define AT32_OTGFS_HCINTMSK(n)         (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK_OFFSET(n))
#define AT32_OTGFS_HCINTMSK0           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK0_OFFSET)
#define AT32_OTGFS_HCINTMSK1           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK1_OFFSET)
#define AT32_OTGFS_HCINTMSK2           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK2_OFFSET)
#define AT32_OTGFS_HCINTMSK3           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK3_OFFSET)
#define AT32_OTGFS_HCINTMSK4           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK4_OFFSET)
#define AT32_OTGFS_HCINTMSK5           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK5_OFFSET)
#define AT32_OTGFS_HCINTMSK6           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK6_OFFSET)
#define AT32_OTGFS_HCINTMSK7           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK7_OFFSET)
#define AT32_OTGFS_HCINTMSK8           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK8_OFFSET)
#define AT32_OTGFS_HCINTMSK9           (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK9_OFFSET)
#define AT32_OTGFS_HCINTMSK10          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK10_OFFSET)
#define AT32_OTGFS_HCINTMSK11          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK11_OFFSET)
#define AT32_OTGFS_HCINTMSK12          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK12_OFFSET)
#define AT32_OTGFS_HCINTMSK13          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK13_OFFSET)
#define AT32_OTGFS_HCINTMSK14          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK14_OFFSET)
#define AT32_OTGFS_HCINTMSK15          (AT32_OTGFS1_BASE+AT32_OTGFS_HCINTMSK15_OFFSET)

#define AT32_OTGFS_HCTSIZ(n)           (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ_OFFSET(n))
#define AT32_OTGFS_HCTSIZ0             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ0_OFFSET)
#define AT32_OTGFS_HCTSIZ1             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ1_OFFSET)
#define AT32_OTGFS_HCTSIZ2             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ2_OFFSET)
#define AT32_OTGFS_HCTSIZ3             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ3_OFFSET)
#define AT32_OTGFS_HCTSIZ4             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ4_OFFSET)
#define AT32_OTGFS_HCTSIZ5             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ5_OFFSET)
#define AT32_OTGFS_HCTSIZ6             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ6_OFFSET)
#define AT32_OTGFS_HCTSIZ7             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ7_OFFSET)
#define AT32_OTGFS_HCTSIZ8             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ8_OFFSET)
#define AT32_OTGFS_HCTSIZ9             (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ9_OFFSET)
#define AT32_OTGFS_HCTSIZ10            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ10_OFFSET)
#define AT32_OTGFS_HCTSIZ11            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ11_OFFSET)
#define AT32_OTGFS_HCTSIZ12            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ12_OFFSET)
#define AT32_OTGFS_HCTSIZ13            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ13_OFFSET)
#define AT32_OTGFS_HCTSIZ14            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ14_OFFSET)
#define AT32_OTGFS_HCTSIZ15            (AT32_OTGFS1_BASE+AT32_OTGFS_HCTSIZ15_OFFSET)

/* Device-mode control and status registers */

#define AT32_OTGFS_DCFG                (AT32_OTGFS1_BASE+AT32_OTGFS_DCFG_OFFSET)
#define AT32_OTGFS_DCTL                (AT32_OTGFS1_BASE+AT32_OTGFS_DCTL_OFFSET)
#define AT32_OTGFS_DSTS                (AT32_OTGFS1_BASE+AT32_OTGFS_DSTS_OFFSET)
#define AT32_OTGFS_DIEPMSK             (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPMSK_OFFSET)
#define AT32_OTGFS_DOEPMSK             (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPMSK_OFFSET)
#define AT32_OTGFS_DAINT               (AT32_OTGFS1_BASE+AT32_OTGFS_DAINT_OFFSET)
#define AT32_OTGFS_DAINTMSK            (AT32_OTGFS1_BASE+AT32_OTGFS_DAINTMSK_OFFSET)
#define AT32_OTGFS_DIEPEMPMSK          (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPEMPMSK_OFFSET)

#define AT32_OTGFS_DIEP(n)             (AT32_OTGFS1_BASE+AT32_OTGFS_DIEP_OFFSET(n))
#define AT32_OTGFS_DIEPCTL(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL_OFFSET(n))
#define AT32_OTGFS_DIEPCTL0            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL0_OFFSET)
#define AT32_OTGFS_DIEPCTL1            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL1_OFFSET)
#define AT32_OTGFS_DIEPCTL2            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL2_OFFSET)
#define AT32_OTGFS_DIEPCTL3            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL3_OFFSET)
#define AT32_OTGFS_DIEPCTL4            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL4_OFFSET)
#define AT32_OTGFS_DIEPCTL5            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL5_OFFSET)
#define AT32_OTGFS_DIEPCTL6            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL6_OFFSET)
#define AT32_OTGFS_DIEPCTL7            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPCTL7_OFFSET)

#define AT32_OTGFS_DIEPINT(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT_OFFSET(n))
#define AT32_OTGFS_DIEPINT0            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT0_OFFSET)
#define AT32_OTGFS_DIEPINT1            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT1_OFFSET)
#define AT32_OTGFS_DIEPINT2            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT2_OFFSET)
#define AT32_OTGFS_DIEPINT3            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT3_OFFSET)
#define AT32_OTGFS_DIEPINT4            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT4_OFFSET)
#define AT32_OTGFS_DIEPINT5            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT5_OFFSET)
#define AT32_OTGFS_DIEPINT6            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT6_OFFSET)
#define AT32_OTGFS_DIEPINT7            (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPINT7_OFFSET)

#define AT32_OTGFS_DIEPTSIZ(n)         (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ_OFFSET(n))
#define AT32_OTGFS_DIEPTSIZ0           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ0_OFFSET)
#define AT32_OTGFS_DIEPTSIZ1           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ1_OFFSET)
#define AT32_OTGFS_DIEPTSIZ2           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ2_OFFSET)
#define AT32_OTGFS_DIEPTSIZ3           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ3_OFFSET)
#define AT32_OTGFS_DIEPTSIZ4           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ4_OFFSET)
#define AT32_OTGFS_DIEPTSIZ5           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ5_OFFSET)
#define AT32_OTGFS_DIEPTSIZ6           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ6_OFFSET)
#define AT32_OTGFS_DIEPTSIZ7           (AT32_OTGFS1_BASE+AT32_OTGFS_DIEPTSIZ7_OFFSET)

#define AT32_OTGFS_DTXFSTS(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS_OFFSET(n))
#define AT32_OTGFS_DTXFSTS0            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS0_OFFSET)
#define AT32_OTGFS_DTXFSTS1            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS1_OFFSET)
#define AT32_OTGFS_DTXFSTS2            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS2_OFFSET)
#define AT32_OTGFS_DTXFSTS3            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS3_OFFSET)
#define AT32_OTGFS_DTXFSTS4            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS4_OFFSET)
#define AT32_OTGFS_DTXFSTS5            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS5_OFFSET)
#define AT32_OTGFS_DTXFSTS6            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS6_OFFSET)
#define AT32_OTGFS_DTXFSTS7            (AT32_OTGFS1_BASE+AT32_OTGFS_DTXFSTS7_OFFSET)

#define AT32_OTGFS_DOEP(n)             (AT32_OTGFS1_BASE+AT32_OTGFS_DOEP_OFFSET(n))
#define AT32_OTGFS_DOEPCTL(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL_OFFSET(n))
#define AT32_OTGFS_DOEPCTL0            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL0_OFFSET)
#define AT32_OTGFS_DOEPCTL1            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL1_OFFSET)
#define AT32_OTGFS_DOEPCTL2            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL2_OFFSET)
#define AT32_OTGFS_DOEPCTL3            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL3_OFFSET)
#define AT32_OTGFS_DOEPCTL4            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL4_OFFSET)
#define AT32_OTGFS_DOEPCTL5            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL5_OFFSET)
#define AT32_OTGFS_DOEPCTL6            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL6_OFFSET)
#define AT32_OTGFS_DOEPCTL7            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPCTL7_OFFSET)

