apache/nuttx/arch/arm/src/at32/hardware/at32fxxxxx_otgfs.h
#define AT32_OTGFS_DOEPINT(n)          (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT_OFFSET(n))
#define AT32_OTGFS_DOEPINT0            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT0_OFFSET)
#define AT32_OTGFS_DOEPINT1            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT1_OFFSET)
#define AT32_OTGFS_DOEPINT2            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT2_OFFSET)
#define AT32_OTGFS_DOEPINT3            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT3_OFFSET)
#define AT32_OTGFS_DOEPINT4            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT4_OFFSET)
#define AT32_OTGFS_DOEPINT5            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT5_OFFSET)
#define AT32_OTGFS_DOEPINT6            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT6_OFFSET)
#define AT32_OTGFS_DOEPINT7            (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPINT7_OFFSET)

#define AT32_OTGFS_DOEPTSIZ(n)         (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ_OFFSET(n))
#define AT32_OTGFS_DOEPTSIZ0           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ0_OFFSET)
#define AT32_OTGFS_DOEPTSIZ1           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ1_OFFSET)
#define AT32_OTGFS_DOEPTSIZ2           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ2_OFFSET)
#define AT32_OTGFS_DOEPTSIZ3           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ3_OFFSET)
#define AT32_OTGFS_DOEPTSIZ4           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ4_OFFSET)
#define AT32_OTGFS_DOEPTSIZ5           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ5_OFFSET)
#define AT32_OTGFS_DOEPTSIZ6           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ6_OFFSET)
#define AT32_OTGFS_DOEPTSIZ7           (AT32_OTGFS1_BASE+AT32_OTGFS_DOEPTSIZ7_OFFSET)

/* Power and clock gating registers */

#define AT32_OTGFS_PCGCCTL             (AT32_OTGFS1_BASE+AT32_OTGFS_PCGCCTL_OFFSET)

/* Data FIFO (DFIFO) access registers */

#define AT32_OTGFS_DFIFO_DEP(n)        (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP_OFFSET(n))
#define AT32_OTGFS_DFIFO_HCH(n)        (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH_OFFSET(n))

#define AT32_OTGFS_DFIFO_DEP0          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP0_OFFSET)
#define AT32_OTGFS_DFIFO_HCH0          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH0_OFFSET)

#define AT32_OTGFS_DFIFO_DEP1          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP1_OFFSET)
#define AT32_OTGFS_DFIFO_HCH1          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH1_OFFSET)

#define AT32_OTGFS_DFIFO_DEP2          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP2_OFFSET)
#define AT32_OTGFS_DFIFO_HCH2          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH2_OFFSET)

#define AT32_OTGFS_DFIFO_DEP3          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP3_OFFSET)
#define AT32_OTGFS_DFIFO_HCH3          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH3_OFFSET)

#define AT32_OTGFS_DFIFO_DEP4          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP4_OFFSET)
#define AT32_OTGFS_DFIFO_HCH4          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH4_OFFSET)

#define AT32_OTGFS_DFIFO_DEP5          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP5_OFFSET)
#define AT32_OTGFS_DFIFO_HCH5          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH5_OFFSET)

#define AT32_OTGFS_DFIFO_DEP6          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP6_OFFSET)
#define AT32_OTGFS_DFIFO_HCH6          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH6_OFFSET)

#define AT32_OTGFS_DFIFO_DEP7          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_DEP7_OFFSET)
#define AT32_OTGFS_DFIFO_HCH7          (AT32_OTGFS1_BASE+AT32_OTGFS_DFIFO_HCH7_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Core global control and status registers */

/* Control and status register */

#define OTGFS_GOTGCTL_CIDSTS            (1 << 16) /* Bit 16: Connector ID status */
#define OTGFS_GOTGCTL_CURMOD            (1 << 21) /* Bit 21: Current Mode of Operation */

/* Interrupt register */

#define OTGFS_GOTGINT_SEDET             (1 << 2)  /* Bit 2: Session end detected */

/* AHB configuration register */

#define OTGFS_GAHBCFG_GINTMSK           (1 << 0)  /* Bit 0: Global interrupt mask */
                                                  /* Bits 1-6: Reserved, must be kept at reset value */
#define OTGFS_GAHBCFG_TXFELVL           (1 << 7)  /* Bit 7: TxFIFO empty level */
#define OTGFS_GAHBCFG_PTXFELVL          (1 << 8)  /* Bit 8: Periodic TxFIFO empty level */
                                                  /* Bits 20-31: Reserved, must be kept at reset value */

/* USB configuration register */

#define OTGFS_GUSBCFG_TOCAL_SHIFT       (0)       /* Bits 0-2: FS timeout calibration */
#define OTGFS_GUSBCFG_TOCAL_MASK        (7 << OTGFS_GUSBCFG_TOCAL_SHIFT)

#define OTGFS_GUSBCFG_TRDT_SHIFT        (10)      /* Bits 10-13: USB turnaround time */
#define OTGFS_GUSBCFG_TRDT_MASK         (15 << OTGFS_GUSBCFG_TRDT_SHIFT)
#  define OTGFS_GUSBCFG_TRDT(n)         ((n) << OTGFS_GUSBCFG_TRDT_SHIFT)

#define OTGFS_GUSBCFG_FHMOD             (1 << 29) /* Bit 29: Force host mode */
#define OTGFS_GUSBCFG_FDMOD             (1 << 30) /* Bit 30: Force device mode */
#define OTGFS_GUSBCFG_CTXPKT            (1 << 31) /* Bit 31: Corrupt Tx packet */

/* Reset register */

#define OTGFS_GRSTCTL_CSRST             (1 << 0)  /* Bit 0: Core soft reset */
#define OTGFS_GRSTCTL_HSRST             (1 << 1)  /* Bit 1: HCLK soft reset */
#define OTGFS_GRSTCTL_FCRST             (1 << 2)  /* Bit 2: Host frame counter reset */
                                                  /* Bit 3 Reserved, must be kept at reset value */
#define OTGFS_GRSTCTL_RXFFLSH           (1 << 4)  /* Bit 4: RxFIFO flush */
#define OTGFS_GRSTCTL_TXFFLSH           (1 << 5)  /* Bit 5: TxFIFO flush */
#define OTGFS_GRSTCTL_TXFNUM_SHIFT      (6)       /* Bits 6-10: TxFIFO number */
#define OTGFS_GRSTCTL_TXFNUM_MASK       (31 << OTGFS_GRSTCTL_TXFNUM_SHIFT)
#  define OTGFS_GRSTCTL_TXFNUM_HNONPER  (0 << OTGFS_GRSTCTL_TXFNUM_SHIFT)   /* Non-periodic TxFIFO flush in host mode */
#  define OTGFS_GRSTCTL_TXFNUM_HPER     (1 << OTGFS_GRSTCTL_TXFNUM_SHIFT)   /* Periodic TxFIFO flush in host mode */
#  define OTGFS_GRSTCTL_TXFNUM_HALL     (16 << OTGFS_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in host mode.*/
#  define OTGFS_GRSTCTL_TXFNUM_D(n)     ((n) << OTGFS_GRSTCTL_TXFNUM_SHIFT) /* TXFIFO n flush in device mode, n=0-15 */
#  define OTGFS_GRSTCTL_TXFNUM_DALL     (16 << OTGFS_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in device mode.*/

/*                                                   Bits 11-31: Reserved,
 *                                                must be kept at reset value
 */
#define OTGFS_GRSTCTL_AHBIDL            (1 << 31) /* Bit 31: AHB master idle */

